FedericaPaoli1/stm32-speech-recognition-and-traduction/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 * @author		   : Federica Paoli'
 * @author		   : Stefano Taverni
 * @date	       : 2022-1
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include <execution_time.h>
#include "main.h"
#include "pdm2pcm.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <inttypes.h>

/* BSP drivers */
#include "../../Drivers/BSP/STM32F4-Discovery/stm32f4_discovery.h"
#include "../../Drivers/BSP/STM32F4-Discovery/stm32f4_discovery_audio.h"

/* Audio processing */
#include "arm_math.h"
#include "feature_extraction.h"

#include "commands.h"
#include "audio_record.h"

/* AI model */
#include "ai_datatypes_defines.h"
#include "ai_platform.h"
#include "speech_commands_model.h"
#include "speech_commands_model_data.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

enum leds_status {
	Off, Green, Blue, Red, Orange
};

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* Input signal sampling rate */
#define SAMPLE_RATE  16000U

/* Number of FFT points. It must be greater or equal to FRAME_LEN */
#define FFT_LEN       2048U

/* Window length and then padded with zeros to match FFT_LEN */
#define FRAME_LEN   FFT_LEN

/* Number of overlapping samples between successive frames */
#define HOP_LEN        512U

/* Number of Mel bands */
#define NUM_MELS       128U

/* Number of Mel filter weights. Returned by MelFilterbank_Init */
#define NUM_MEL_COEFS 2020U

/* Number of MFCCs to return */
#define NUM_MFCC        16U

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;
I2C_HandleTypeDef hi2c1;
I2S_HandleTypeDef hi2s2;
DMA_HandleTypeDef hdma_spi2_rx;
SPI_HandleTypeDef hspi1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

/* Instance for floating-point RFFT/RIFFT */
arm_rfft_fast_instance_f32 rfft;

/* Instance for the floating-point MelFilterbank function */
MelFilterTypeDef mel_filter;

/* Instance for the floating-point DCT functions */
DCT_InstanceTypeDef dct;

/* Instance for the floating-point Spectrogram function */
SpectrogramTypeDef spectrogram;

/* Instance for the floating-point MelSpectrogram function */
MelSpectrogramTypeDef mel_spectrogram;

/* Instance for the floating-point Log-MelSpectrogram function */
LogMelSpectrogramTypeDef log_mel_spectrogram;

/* Instance for the floating-point Mfcc function */
MfccTypeDef mfcc;

/* Intermediate buffer that contains a signal frame */
float32_t frame_buffer[FRAME_LEN];

/* Intermediate buffer that contains Mel-Frequency Cepstral Coefficients (MFCCs) column  */
float32_t mfcc_col_buffer[NUM_MFCC];

/* Intermediate buffer that contains the window function  */
float32_t window_func_buffer[FRAME_LEN];

/* Temporary calculation buffer of length `FFT_LEN` */
float32_t spectrogram_scratch_buffer[FFT_LEN];

/* Intermediate buffer that contains the Discrete Cosine Transform coefficients */
float32_t dct_coefs_buffer[NUM_MELS * NUM_MFCC];

/* Temporary calculation buffer of length `NUM_MELS` */
float32_t mfcc_scratch_buffer[NUM_MELS];

/*Intermediate buffer that contains the Mel filter weights of length `NUM_MEL_COEFS` */
float32_t mel_filter_coefs[NUM_MEL_COEFS];

/* Intermediate buffer that contains the Mel filter coefficients start indices */
uint32_t mel_filter_start_indices[NUM_MELS];

/* Intermediate buffer that contains the Mel filter coefficients stop indices */
uint32_t mel_filter_stop_indices[NUM_MELS];

/* Number of frames of the input signal */
uint32_t num_frames = 1 + (PCM_BUFFER_SIZE - FRAME_LEN) / HOP_LEN;

/* Buffer used to print through the USART interface */
char usart_buffer[50];
int usart_buffer_length = 0;

/* Control words display */
uint8_t display_words_enabled = 0;

/* Control print of words `ON` and `VISUAL`  */
uint8_t print_words = 1;

/* Board led status  */
enum leds_status led_status = Off;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2S2_Init(void);
static void MX_CRC_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
/* USER CODE BEGIN PFP */

/* Initialize audio processing structures */
void Preprocessing_Init(void);

/* MCU sleep mode */
void SleepMode(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/**
 * @brief Compute MFCCs from the input signal audio.
 *   This function normalizes the input audio data in PCM form and extracts the
 *   MFCCs from them.
 *
 * @param  input_signal*   PCM input signal
 * @param  out_mfcc*       MFCCs output buffer
 * @param  signal_len      length of the input signal
 *
 * @retval None
 */
void preprocess_audio(int16_t *input_signal, float32_t *out_mfcc,
		uint32_t signal_len) {

	for (uint32_t frame_index = 0; frame_index < num_frames; frame_index++) {

