FedericaPaoli1/stm32-speech-recognition-and-traduction/Core/Src/main.c
		/* Convert 16-bit PCM into normalized floating point values */
		buf_to_float_normed(&input_signal[HOP_LEN * frame_index], frame_buffer,
		FRAME_LEN);

		MfccColumn(&mfcc, frame_buffer, mfcc_col_buffer);

		/* Reshape column into `out_mfcc` */
		for (uint32_t i = 0; i < NUM_MFCC; i++) {
			out_mfcc[i * num_frames + frame_index] = mfcc_col_buffer[i];
		}
	}
}

/**
 * @brief Compute MFCCs from the input signal audio.
 *   This function normalizes the input audio data in PCM form and extracts the
 *   MFCCs from them.
 *
 * @param  input_signal*   PCM input signal
 * @param  out_mfcc*       MFCCs output buffer
 * @param  signal_len      length of the input signal
 *
 * @retval None
 */
void recognize_commands(const char *word) {
	if (strcmp(word, ONE) == 0) {
		if (led_status != Green) {
			if (led_status == Blue) {
				HAL_GPIO_TogglePin(GPIOD, LD6_Pin);
			} else if (led_status == Red) {
				HAL_GPIO_TogglePin(GPIOD, LD5_Pin);
			} else if (led_status == Orange) {
				HAL_GPIO_TogglePin(GPIOD, LD3_Pin);
			}
			// GREEN LED
			HAL_GPIO_TogglePin(GPIOD, LD4_Pin);
			led_status = Green;
		}
	} else if (strcmp(word, TWO) == 0) {
		if (led_status != Blue) {
			if (led_status == Green) {
				HAL_GPIO_TogglePin(GPIOD, LD4_Pin);
			} else if (led_status == Red) {
				HAL_GPIO_TogglePin(GPIOD, LD5_Pin);
			} else if (led_status == Orange) {
				HAL_GPIO_TogglePin(GPIOD, LD3_Pin);
			}
			// BLUE LED
			HAL_GPIO_TogglePin(GPIOD, LD6_Pin);
			led_status = Blue;
		}
	} else if (strcmp(word, THREE) == 0) {
		if (led_status != Red) {
			if (led_status == Green) {
				HAL_GPIO_TogglePin(GPIOD, LD4_Pin);
			} else if (led_status == Blue) {
				HAL_GPIO_TogglePin(GPIOD, LD6_Pin);
			} else if (led_status == Orange) {
				HAL_GPIO_TogglePin(GPIOD, LD3_Pin);
			}
			// RED LED
			HAL_GPIO_TogglePin(GPIOD, LD5_Pin);
			led_status = Red;
		}
	} else if (strcmp(word, FOUR) == 0) {
		if (led_status != Orange) {
			if (led_status == Green) {
				HAL_GPIO_TogglePin(GPIOD, LD4_Pin);
			} else if (led_status == Blue) {
				HAL_GPIO_TogglePin(GPIOD, LD6_Pin);
			} else if (led_status == Red) {
				HAL_GPIO_TogglePin(GPIOD, LD5_Pin);
			}
			// ORANGE LED
			HAL_GPIO_TogglePin(GPIOD, LD3_Pin);
			led_status = Orange;
		}
	}

	// case in which the word spoken is different from the four colors
	else {
		// if there is a led on, turn it off
		if (led_status == Green) {
			HAL_GPIO_TogglePin(GPIOD, LD4_Pin);
		} else if (led_status == Blue) {
			HAL_GPIO_TogglePin(GPIOD, LD6_Pin);
		} else if (led_status == Red) {
			HAL_GPIO_TogglePin(GPIOD, LD5_Pin);
		} else if (led_status == Orange) {
			HAL_GPIO_TogglePin(GPIOD, LD3_Pin);
		}

		led_status = Off;

		if (strcmp(word, ON) == 0) {
			print_words = 0;
			if (!display_words_enabled) {	// We need to enable words display
				usart_buffer_length = sprintf(usart_buffer,
						"Now the words will be displayed\r\n");
				HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
						usart_buffer_length, 100);
			} else {		// Words display is already enabled
				usart_buffer_length = sprintf(usart_buffer,
						"Words display is already enabled\r\n");
				HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
						usart_buffer_length, 100);
			}

			// enable words display
			display_words_enabled = 1;
		} else if (strcmp(word, OFF) == 0) {
			// disable the display of the words
			if (display_words_enabled) {
				display_words_enabled = 0;

				usart_buffer_length = sprintf(usart_buffer,
						"Now the words will not be displayed anymore\r\n");
				HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
						usart_buffer_length, 100);
			}
		} else if (strcmp(word, VISUAL) == 0) {
			print_words = 0;

			for (uint8_t i = 0; i < EXECUTION_TIME_MAX_SECTIONS; i++) {
				switch (i) {
				case 0:
					usart_buffer_length = sprintf(usart_buffer,
							"Audio acquisition execution time:\r\n");
					break;
				case 1:
					usart_buffer_length = sprintf(usart_buffer,
							"MFCCs extraction execution time:\r\n");
					break;
				case 2:
					usart_buffer_length = sprintf(usart_buffer,
							"Inference execution time:\r\n");
					break;
				default:
					break;
					// unreachable
				}
				HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
						usart_buffer_length, 100);

				usart_buffer_length = sprintf(usart_buffer, "\telapsed=%lu\r\n",
						time_statistics_blocks[i].elapsed);
				HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
						usart_buffer_length, 100);

				usart_buffer_length = sprintf(usart_buffer, "\tmax=%lu\r\n",
						time_statistics_blocks[i].max);
				HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
						usart_buffer_length, 100);

				usart_buffer_length = sprintf(usart_buffer, "\tmin=%lu\r\n",
						time_statistics_blocks[i].min);
				HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
						usart_buffer_length, 100);
			}
		} else if (strcmp(word, STOP) == 0) {

			print_words = 0;

			usart_buffer_length = sprintf(usart_buffer,
					"Execution times are now reset\r\n");
			HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
					usart_buffer_length, 100);

			for (uint8_t i = 0; i < EXECUTION_TIME_MAX_SECTIONS; i++) {
				execution_time_clear(i);
			}
		}
	}
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {
	/* USER CODE BEGIN 1 */

	ai_error ai_err;
	ai_i32 nbatch;

	// Chunk of memory used to hold intermediate values for neural network
	AI_ALIGNED(4) ai_u8 activations[AI_SPEECH_COMMANDS_MODEL_DATA_ACTIVATIONS_SIZE];
	//AI_ALIGNED(4): specify a minimum alignment measured in bytes

	// Buffers used to store input and output tensors
	AI_ALIGNED(4) ai_float in_data[AI_SPEECH_COMMANDS_MODEL_IN_1_SIZE_BYTES];
	AI_ALIGNED(4) ai_float out_data[AI_SPEECH_COMMANDS_MODEL_OUT_1_SIZE_BYTES];

	// Pointer to our model
	ai_handle speech_commands_model = AI_HANDLE_NULL;

	// Initialize wrapper structs that hold pointers to data and info about the
	// data (tensor height, width, channels)
	ai_buffer ai_input[AI_SPEECH_COMMANDS_MODEL_IN_NUM] =
	AI_SPEECH_COMMANDS_MODEL_IN;
	ai_buffer ai_output[AI_SPEECH_COMMANDS_MODEL_OUT_NUM] =
	AI_SPEECH_COMMANDS_MODEL_OUT;

	// Set working memory and get weights/biases from model
	ai_network_params ai_params =
					AI_NETWORK_PARAMS_INIT(
							AI_SPEECH_COMMANDS_MODEL_DATA_WEIGHTS(ai_speech_commands_model_data_weights_get()),
							AI_SPEECH_COMMANDS_MODEL_DATA_ACTIVATIONS(activations)
					);

	// Set pointers wrapper structs to our data buffers
	ai_input[0].n_batches = 1;
	ai_input[0].data = AI_HANDLE_PTR(in_data);
	ai_output[0].n_batches = 1;
	ai_output[0].data = AI_HANDLE_PTR(out_data);

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

